[General]
Version=1.9.0
LanguageName=Thai 
lblLanguageAuthor=Suteepat (Jonathanz)

[Form1]
speedWarningLabel=คำเตือน: ความเร็วมากกว่า 20000 KB/s อาจดูน่าสงสัย
checkShowTrayBaloon=แสดงข้อมูลเมื่อวางเมาส์เหนือไอคอนถาดระบบ
lblInterface=ส่วนติดต่อ:
lblLanguage=ภาษา:
TorrentFileLabel=ที่อยู่ไฟล์:
closeButton=ออก
StartButton=เริ่ม
tabGeneral=ทั่วไป
groupTorrentFile=ไฟล์ทอเรนท์
browseButton=เปิด...
groupStats=สถิติ
totalRunningTimeLabel=เวลาทั้งหมด :
leechLabel=Leechers:
seedLabel=Seeders:
manualUpdateButton=อัพเดตด้วยตัวเอง
labelUpdateIn=อัพเดตครั้งต่อไป:
downloadCountLabel=ดาวน์โหลดแล้ว :
uploadCountLabel=อัพโหลดแล้ว :
groupBoxOptions=ตัวเลือก
applyStopSettingsButton=นำไปใช้
stopProcessLabel=หยุดการทำงานเมื่อ:
FileSizeLabel=เสร็จสิ้น (%)
uploadRateLabel=อัตราการอัพโหลด (kB/s) :
downloadRateLabel=อัตราการดาวน์โหลด (kB/s) :
groupTorrentInfo=ข้อมูลไฟล์ทอเรนท์
labelTorrentSize=ขนาดไฟล์:
hashLabel=SHA แฮช:
TrackerLabel=Tracker:
tabAdvanced=ขั้นสูง
memoryReaderButton=ตัวอ่านหน่วยความจำ...
updateAnnounceParamsOnStart=อัพเดต peer_id และ key เมื่อเปิดโปรแกรม
checkNewVersion=ตรวจสอบเวอร์ชั่นล่าสุด
ClientLabel=จำลองโปรแกรมทอเรนท์:
randomSpeedGroup=สุ่มอัตราการ อัพโหลด/ดาวน์โหลด
RandomDownloadToLabel=สูงสุด:
RandomUploadToLabel=สูงสุด:
RandomDownloadFromLabel=ขั้นต่ำ:
RandomUploadFromLabel=ขั้นต่ำ:
checkRandomDownload=ดาวน์โหลด (kB)
checkRandomUpload=อัพโหลด (kB)
reportParamsGroup=Announce พารามิเตอร์
keyLabel=Key (key):
labelPeerID=Peer ID (peer_id):
numwantLabel=จำนวน Peers (numwant):
portInfoLabel=หากฟิลด์เหล่านี้ถูกเว้นว่างไว้, RatioMaster จะใช้ค่าสุ่มหรือค่าดีฟอลต์แทน
portLabel=Port (port):
tabNetwork=เครือข่าย
groupNetworkMisc=อื่นๆ
checkIgnoreFailureReason=ไม่สนใจ 'failure reason' จาก tracker
labelStopMinLeecher=หยุดการอัพโหลดเมื่อจำนวน Leechers น้อยกว่า:
intervalLabel=ช่วงเวลาในการอัพเดต Tracker (วินาที):
checkRequestScrap=รับข้อมูลของ Seeders/Leechers (ดึงข้อมูลมาจาก tracker)
checkTCPListen=ใช้ TCP listener (ทำให้เป็น connectable บน tracker)
proxySettingsGroup=การตั้งค่า Proxy Server
labelProxyPass=Password:
labelProxyUser=User:
labelProxyPort=Port:
labelProxyHost=Host:
labelProxyType=ชนิดของ Proxy:
tabLog=บันทึกการทำงาน
saveLogButton=บันทึก Log
checkLogEnabled=เปิดใช้บันทึกการทำงาน
checkHideConfidentialInfo=ซ่อนข้อมูลลับ
clearLogButton=เคลียร์ Log
tabAbout=เกี่ยวกับ
labelForums=เว็บบอร์ด:
labelWebSite=เว็บไซต์:
StopButton=หยุด
linkProxyHelp=ช่วยเหลือเกี่ยวกับ proxies
tabUpdates=อัพเดต
installUpdatesButton=ติดตั้งอัพเดต
checkUpdatesButton=ตรวจสอบการอัพเดต
labelUpdates=ไคลเอนต์และภาษา
labelBindIp=เชื่อมกับ IP:
checkMinimizeToTray=ซ่อนไปที่ tray
checkIgnoreTimeout=ไม่สนใจเมื่อการเชื่อมต่อผิดพลาด
checkUPnP=เปิดการใช้งาน UPnP port mapping
testNetworkButton=ทดสอบการตั้งค่า...
ResetCountersButton=Reset ตัวนับสถิติ
checkSavePeers=บันทึกรายชื่อ Peers


[MemoryReader]
reApplyButton=นำไปใช้
reCloseButton=ปิด
groupBoxSearchResults=ผลการค้นหา
reHashLabel=Hash:
rePeerIdLabel=Peer ID (peer_id):
reKeyLabel=Key (key):
numwantLabel=จำนวน Peers (numwant):
rePortLabel=Port (port):
reSearchStrLabel=String:
reSearchButton=ค้นหา
reProcessNameLabel=ชื่อของ Process:

[Messages]
mrNoProcessFound=ไม่พบ process ของ {0} \r\nตรวจสอบให้แน่ใจว่าโปรแกรมทอเรนท์กำลังทำงานและมีไฟล์งานทอเรนท์อย่างน้อยหนึ่งงาน
mrSearchFail=ค้นหาไม่สำเร็จ\r\nตรวจสอบให้แน่ใจว่าโปรแกรมทอเรนท์กำลังทำงานและมีไฟล์งานทอเรนท์อย่างน้อยหนึ่งงาน
mrSearchTitle=ค้นหา
mrSearchSuccess=การค้นหาเสร็จสมบูรณ์!\r\nกดปุ่ม นำไปใช้ เพื่อนำค่าที่ค้นหาได้ไปใช้กับโปรแกรมทอเรนท์
vrNewVersionReleased=ตรวจพบเวอร์ชั่นใหม่! ดาวน์โหลดได้ที่ http://www.moofdev.net?
vrNewVersionTitle="ตรวจพบเวอร์ชั่นที่ใหม่กว่า"
ballonUploaded=อัพโหลดแล้ว: {0} \r\n
ballonDownloaded=ดาวน์โหลดแล้ว: {0} \r\n
ballonUpdateIn=อัพเดตครั้งต่อไป: {0} \r\n
ballonTotalTime=เวลาทั้งหมด: {0} \r\n
stopProcessOpt1=ไม่หยุด
stopProcessOpt2=อัพโหลดแล้ว
stopProcessOpt3=ดาวน์โหลดแล้ว
stopProcessOpt4=เวลาผ่านไป
stopProcessOpt5=ปล่อยต่อ 1.2x
stopProcessUnits1=วินาที
stopProcessUnits2=นาที
stopProcessUnits3=ชั่วโมง
restoreToolStripMenuItem=เรียกคืน
exitToolStripMenuItem=ออก
umNumUpdatesFound=พบ {0} อัพเดต
umNoUpdatesFound=ไม่มีการอัพเดตใหม่
umParsingUpdates=กำลังวิเคราะห์การอัพเดต...
umCheckingUpdates=กำลังตรวจสอบการอัพเดต...
umDownloadingUpdate=กำลังดาวน์โหลดการอัพเดต {0}
umFinishedDownloadingUpdates=การอัพเดตเสร็จสมบูรณ์
clmnUpdateName=ชื่อ
clmnUpdateFileName=ชื่อไฟล์
clmnUpdateType=ชนิด
clmnUpdateAuthor=ผู้แต่ง
confirmCloseTitle=ยืนยัน
confirmCloseMessage=ไฟล์ทอเรนท์กำลังทำงานอยู่ คุณต้องการออกจาก RatioMaster หรือไม่?
defaultBinding=ค่าดีฟอลต์
testNetworkSuccess=เชื่อมต่อสำเร็จ การตั้งค่าเครือข่ายปัจจุบันของ RatioMaster สามารถใช้งานได้.
testNetworkFailed=การเชื่อมต่อผิดพลาด
testNetworkInProgress=กำลังทดสอบการตั้งค่าเครือข่าย...

[Tooltips]
checkIgnoreFailureReason=RM จะไม่สนใจ error ที่ได้รับจาก tracker และจะอัพโหลดต่อไปตามปกติ
labelStopMinLeecher=RM จะปรับค่าอัพโหลดเป็นศูนย์โดยอัติโนมัติ เมื่อจำนวน leechers น้อยกว่าค่าที่กำหนด
intervalLabel=ช่วงเวลาในการส่งข้อมูลไปยัง tracker\r\nมีประโยชน์กับ tracker ที่ไม่ส่งค่าช่วงเวลาในการอัพเดตมาให้
proxySettingsGroup=RM สามารถเชื่อมต่อไปยัง tracker โดยใช้ proxy เพื่อซ่อน IP ที่อยู่จริง
memoryReaderButton=ตัวอ่านหน่วยความจำ\r\nใช้เครื่องมือนี้ในการจำลองพารามิเตอร์ของโปรแกรมทอเรนท์ \r\nเช่น peer_id, key, port และค่าอื่นๆ
updateAnnounceParamsOnStart=เมื่อ checkbox ถูกเลือก RM จะสร้างค่า peer_id และ key ใหม่ทุกครั้งที่เริ่มโปรแกรม\r\nหากไม่ได้เลือก RM จะใช้ค่าเดิมจากครั้งก่อน
TorrentClientsBox=ใช้ ComboBox นี้ เพื่อเลือกโปรแกรมทอเรนท์ที่ต้องการจำลอง
randomSpeedGroup=Rm สามารถสุ่มอัตราการ อัพโหลด/ดาวน์โหลด\r\nตามการตั้งค่าเหล่านี้\r\nการอัพโหลดด้วยอัตราเร็วเท่าเดิมนานๆทำให้เป็นที่น่าสงสัย
torrentFile=ที่อยู่ไฟล์ทอเรนท์\r\nคลิกปุ่ม เปิด... หรือ ลากและวางไฟล์ทอเรนท์ลงบนหน้าต่างโปรแกรม RM
totalRunningTimeLabel=เวลาที่ใช้ไปแล้วทั้งหมด
leechLabel=Leechers ของไฟล์ทอเรนท์นี้\r\nข้อมูลนี้ไม่สามารถดูได้ในบาง tracker
seedLabel=Seeders ของไฟล์ทอเรนท์นี้\r\nข้อมูลนี้ไม่สามารถดูได้ในบาง tracker
manualUpdateButton=อัพเดตด้วยตัวเอง\r\nคุณสามารถเลือกที่จะอัพเดต Tracker ได้ด้วยตัวเอง ทำให้ข้อมูลสถิติของคุณบน tracker ถูกปรับเป็นข้อมูลสถิติล่าสุด
labelUpdateIn=เวลาในการอัพเดตครั้งต่อไป
downloadCountLabel=ดาวน์โหลดแล้ว\r\nข้อมูลสถิติของคุณบน tracker จะถูกปรับหลังการอัพเดตครั้งต่อไป
uploadCountLabel=อัพโหลดแล้ว\r\nข้อมูลสถิติของคุณบน tracker จะถูกปรับหลังการอัพเดตครั้งต่อไป
checkIgnoreTimeout=RM จะไม่สนใจเมื่อการเชื่อมต่อผิดพลาด
stopProcessActionBox=RM สามารถหยุดการทำงานโดยอัตโนมัติ\r\nเลือกตัวเลือกต่างๆและใส่ค่าลงในฟิลด์
uploadRate=อัตราการอัพโหลด\r\nใส่อัตราเร็วการอัพโหลดที่ RM จะส่งไปยัง tracker
downloadRate=อัตราการดาวน์โหลด\r\nใส่อัตราเร็วการดาวน์โหลดที่ RM จะส่งไปยัง tracker
shaHash=ทอเรนท์ SHA แฮช\r\nคุณสามารถใส่ค่านี้ได้ด้วยตัวเอง หรือให้โปรแกรมสร้างค่าจากไฟล์ทอเรนท์ที่เลือก
trackerAddress=Tracker Url\r\nคุณสามารถใส่ค่านี้ได้ด้วยตัวเอง หรือให้โปรแกรมสร้างค่าจากไฟล์ทอเรนท์ที่เลือก
fileSize=เสร็จสิ้น %\r\nคุณสามารถใส่จำนวนการดาวน์โหลดเสร็จสิ้นของไฟล์ทอเรนท์\r\n100% = คน Seed\r\n0%     = โหลดไฟล์ตั้งแต่เริ่มแรก\r\nRM จดจำค่าการดาวน์โหลดเสร็จสิ้น % รวมถึงค่าอื่นๆ ของไฟล์ทอเรนท์แต่ละไฟล์
reportParamsGroup=พารามิเตอร์เหล่านี้คือส่วนของข้อมูล announce string ที่ RM จะส่งไปยัง tracker\r\nโดยปกติแล้ว RM จะสร้างค่าพารามิเตอร์เหล่านี้โดยอัตโนมัติ แต่คุณสามารถเลือก\r\nที่จะใส่ค่าได้ด้วยตัวเอง หรือใช้เครื่องมือ ตัวอ่านหน่วยความจำ... เพื่อรับค่าพารามิเตอร์จากโปรแกรมทอเรนท์
reProcessNameBox=RM จะทำการค้นหา Process ที่มีชื่อนี้\r\nRM ใส่ช่องนี้ให้อัตโนมัติโดยดูจากโปรแกรมทอเรนท์ปัจจุบันที่เลือกอยู่
reSearchStr=RM ใช้อักขระเหล่านี้เพื่อค้นหา announce URL และวิเคราะห์ผลลัพธ์จากการค้นหา
reSearchButton=กดปุ่ม "ค้นหา" เพื่อเริ่มทำการค้นหา.
groupBoxSearchResults=เมื่อการค้นหาเสร็จสิ้น RM จะใส่ค่าผลลัพธ์การค้นหาลงในช่องเหล่านี้\r\nคัดลอกค่าเหล่านี้ด้วยตัวท่านเอง เพื่อนำไปใส่ในแท็บ ขั้นสูง หรือกดปุ่ม นำไปใช้
reApplyButton=กดปุ่ม "นำไปใช้" เพื่อนำค่าผลลัพธ์การค้นหาไปใช้ในแท็บ ขั้นสูง
